app/Controllers/clientNumeroSoldeController.php

SELECT *
FROM `clientNumeroSolde`
WHERE `idClientNumero` = 1
 LIMIT 1
---
    public function index(){
        $session = session();
        $idClientNumero = $session->get('idClientNumero');

        // Sécurité : Si la session est vide, on redirige vers le login
        if (!$idClientNumero) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
        }

        $data['clientNumeroSoldes'] = $this->clientNumeroSoldeModel
                                          ->where('idClientNumero', $idClientNumero)
                                          ->first();