app/Controllers/clientNumeroController.php

    private function getMouvementsClient()
    {
        $session = session();
        $idClientNumero = $session->get('idClientNumero');

        if (!$idClientNumero) {
            return [];
        }

        return $this->mouvementModel
            ->select('mouvement.*, typeOperation.type as typeOperation, envoyeur.numero as numeroEnvoyeur, recepteur.numero as numeroRecepteur')
            ->join('typeOperation', 'typeOperation.id = mouvement.idTypeOperation', 'left')
            ->join('clientNumero as envoyeur', 'envoyeur.id = mouvement.idEnvoyeur', 'left')
            ->join('clientNumero as recepteur', 'recepteur.id = mouvement.idRecepteur', 'left')
            ->where('mouvement.idEnvoyeur', $idClientNumero)
            ->orWhere('mouvement.idRecepteur', $idClientNumero)
            ->orderBy('mouvement.date', 'DESC')
            ->findAll();
---
SELECT *
FROM `clientNumero`
WHERE `numero` = '0341234567'
 LIMIT 1
SELECT `mouvement`.*, `typeOperation`.`type` as `typeOperation`, `envoyeur`.`numero` as `numeroEnvoyeur`, `recepteur`.`numero` as `numeroRecepteur`
FROM `mouvement`
LEFT JOIN `typeOperation` ON `typeOperation`.`id` = `mouvement`.`idTypeOperation`
LEFT JOIN `clientNumero` as `envoyeur` ON `envoyeur`.`id` = `mouvement`.`idEnvoyeur`
LEFT JOIN `clientNumero` as `recepteur` ON `recepteur`.`id` = `mouvement`.`idRecepteur`
WHERE `mouvement`.`idEnvoyeur` = 5
OR `mouvement`.`idRecepteur` = 5
ORDER BY `mouvement`.`date` DESC