app/Controllers/clientController.php

    public function getClientByNom($nom){
        $client = $this->clientModel->where('nom', $nom)->first();
---
SELECT *
FROM `client`
WHERE `nom` = 'Rakoto'
 LIMIT 1