app/Controllers/clientController.php

    public function getClientByNom($nom){
        $clientModel = new \App\Models\ClientModel();
        $client = $clientModel->where('nom', $nom)->first();
---
SELECT *
FROM `client`
WHERE `nom` = 'Rakoto'
 LIMIT 1