app/Controllers/fraisTypeOperationController.php

    public function index()
    {
        $typeOperationModel = new TypeOperationModel();
        $data['types'] = $typeOperationModel->findAll();

        // On fait une jointure pour récupérer le début et la fin directement avec les frais
        $data['fraisTypeOperation'] = $this->fraisTypeOperationModel
            ->select('fraisTypeOperation.*, intervalMontant.debut, intervalMontant.fin')
            ->join('intervalMontant', 'intervalMontant.id = fraisTypeOperation.idIntervalMontant')
            ->findAll();
---
SELECT *
FROM `fraisTypeOperation`
SELECT *
FROM `typeOperation`
SELECT `fraisTypeOperation`.*, `intervalMontant`.`debut`, `intervalMontant`.`fin`
FROM `fraisTypeOperation`
JOIN `intervalMontant` ON `intervalMontant`.`id` = `fraisTypeOperation`.`idIntervalMontant`