app/Controllers/IntervalMontantController.php

    public function index()
    {
        $model = new IntervalMontantModel();
        $data['intervalles']  = $model->findAll();
---
SELECT *
FROM `intervalMontant`