app/Controllers/mouvementController.php

    public function saveDepot()
    {
        $session = session();
        $idClientNumero = $session->get('idClientNumero');

        if (!$idClientNumero) {
            return redirect()->to('/client')->with('error', 'Veuillez vous connecter.');
        }

        $montant = (float) str_replace(',', '.', $this->request->getPost('montant'));

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Veuillez saisir un montant de dépôt valide.');
        }

        $clientSolde = $this->clientNumeroSoldeModel->where('idClientNumero', $idClientNumero)->first();

        if ($clientSolde) {
            $nouveauSolde = ($clientSolde['solde'] ?? 0) + $montant;
            $this->clientNumeroSoldeModel->update($clientSolde['id'], ['solde' => $nouveauSolde]);
---
SELECT *
FROM `clientNumeroSolde`
WHERE `idClientNumero` = 1
 LIMIT 1
UPDATE `clientNumeroSolde` SET `solde` = 80000
WHERE `clientNumeroSolde`.`id` IN (1)

    public function transfert1()
    {
        $session = session();
        $idClientNumeroConnecte = $session->get('idClientNumero');
        $numeroRecepteurSaisi = $this->request->getPost('recepteur');
        $montant = floatval($this->request->getPost('montant'));
        $avecFrais = $this->request->getPost('avecFrais') === '1';

        if (!$idClientNumeroConnecte || !$numeroRecepteurSaisi || $montant <= 0) {
            return redirect()->back()->with('error', 'Données de transaction invalides.');
        }

        $clientNumeroModel = new \App\Models\ClientNumeroModel();
        $compteRecepteur = $clientNumeroModel->where('numero', $numeroRecepteurSaisi)->first();

        if (!$compteRecepteur) {
            return redirect()->back()->with('error', "Le numéro destinataire '$numeroRecepteurSaisi' n'existe pas.");
        }

        $idClientNumeroRecepteur = $compteRecepteur['id'];

        $fraisTypeOperationModel = new \App\Models\FraisTypeOperationModel();
        $fraisRow = $fraisTypeOperationModel
            ->join('intervalMontant', 'intervalMontant.id = fraisTypeOperation.idIntervalMontant')
            ->where('fraisTypeOperation.idTypeOperation', 3)
            ->where('intervalMontant.debut <=', $montant)
            ->where('intervalMontant.fin >=', $montant)
            ->first();

        if (!$fraisRow) {
            $fraisRow = $fraisTypeOperationModel
                ->select('fraisTypeOperation.*')
                ->join('intervalMontant', 'intervalMontant.id = fraisTypeOperation.idIntervalMontant')
                ->where('fraisTypeOperation.idTypeOperation', 3)
                ->where('intervalMontant.fin <=', $montant)
                ->orderBy('intervalMontant.fin', 'DESC')
                ->first();
        }

        if (!$fraisRow) {
            $fraisRow = $fraisTypeOperationModel
                ->select('fraisTypeOperation.*')
                ->join('intervalMontant', 'intervalMontant.id = fraisTypeOperation.idIntervalMontant')
                ->where('fraisTypeOperation.idTypeOperation', 3)
                ->orderBy('intervalMontant.debut', 'ASC')
                ->first();
---
SELECT *
FROM `clientNumero`
WHERE `numero` = '0337788899'
 LIMIT 1
SELECT *
FROM `fraisTypeOperation`
JOIN `intervalMontant` ON `intervalMontant`.`id` = `fraisTypeOperation`.`idIntervalMontant`
WHERE `fraisTypeOperation`.`idTypeOperation` = 3
AND `intervalMontant`.`debut` <= 200
AND `intervalMontant`.`fin` >= 200
 LIMIT 1
SELECT `fraisTypeOperation`.*
FROM `fraisTypeOperation`
JOIN `intervalMontant` ON `intervalMontant`.`id` = `fraisTypeOperation`.`idIntervalMontant`
WHERE `fraisTypeOperation`.`idTypeOperation` = 3
AND `intervalMontant`.`fin` <= 200
ORDER BY `intervalMontant`.`fin` DESC
 LIMIT 1
SELECT `fraisTypeOperation`.*
FROM `fraisTypeOperation`
JOIN `intervalMontant` ON `intervalMontant`.`id` = `fraisTypeOperation`.`idIntervalMontant`
WHERE `fraisTypeOperation`.`idTypeOperation` = 3
ORDER BY `intervalMontant`.`debut` ASC
 LIMIT 1