app/Controllers/OperateurPrefixController.php

    public function index()
    {
        $prefixModel = new OperateurPrefixModel();
        $operateurModel = new OperateurModel();

        $data['prefixes'] = $prefixModel
            ->select('operateurPrefix.*, operateur.libelle')
            ->join('operateur', 'operateur.id = operateurPrefix.idOperateur')
            ->findAll();

        $data['operateurs'] = $operateurModel->findAll();
---
SELECT `operateurPrefix`.*, `operateur`.`libelle`
FROM `operateurPrefix`
JOIN `operateur` ON `operateur`.`id` = `operateurPrefix`.`idOperateur`
SELECT *
FROM `operateur`