app/Controllers/OperateurController.php

SELECT *
FROM `operateur`
---
    public function index()
    {
        $model = new OperateurModel();
        $data['operateurs']   = $model->findAll();

INSERT INTO `operateur` (`libelle`) VALUES ('Airtel')
---
    public function save()
    {
        $model = new OperateurModel();
        $model->save([
            'libelle' => $this->request->getPost('libelle')
        ]);

DELETE FROM `operateur`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        $model = new OperateurModel();
        $model->delete($id);