app/Controllers/OperateurPrefixController.php

    public function index()
    {
        $prefixModel = new OperateurPrefixModel();
        $operateurModel = new OperateurModel();
        $myOperateurId = defined('MY_OPERATEUR_ID') ? MY_OPERATEUR_ID : null;
        $myOperateurLibelle = defined('MY_OPERATEUR_LIBELLE') ? MY_OPERATEUR_LIBELLE : null;

        $data['myOperateur'] = null;

        if ($myOperateurId) {
            $data['myOperateur'] = $operateurModel->find($myOperateurId);
        }

        if (! $data['myOperateur'] && $myOperateurLibelle) {
            $data['myOperateur'] = $operateurModel->where('libelle', $myOperateurLibelle)->first();
        }

        if (! $data['myOperateur'] && $myOperateurLibelle) {
            $operateurModel->insert(['libelle' => $myOperateurLibelle]);
            $data['myOperateur'] = $operateurModel->find($operateurModel->insertID());
        }

        if (! $data['myOperateur']) {
            $data['myOperateur'] = $operateurModel->orderBy('id', 'ASC')->first();
        }

        $myOperateurId = $data['myOperateur']['id'] ?? null;

        $data['myPrefixes'] = $myOperateurId
            ? $prefixModel->select('operateurPrefix.*')->where('idOperateur', $myOperateurId)->findAll()
            : [];

        $data['otherPrefixes'] = $prefixModel
            ->select('operateurPrefix.*, operateur.libelle')
            ->join('operateur', 'operateur.id = operateurPrefix.idOperateur')
            ->where('operateur.id !=', $myOperateurId)
            ->findAll();

        $data['otherOperateurs'] = $operateurModel->where('id !=', $myOperateurId)->findAll();
---
SELECT *
FROM `operateur`
WHERE `operateur`.`id` = 1
SELECT *
FROM `operateur`
WHERE `libelle` = 'Mon opérateur'
 LIMIT 1
SELECT `operateurPrefix`.*
FROM `operateurPrefix`
WHERE `idOperateur` = 5
SELECT `operateurPrefix`.*, `operateur`.`libelle`
FROM `operateurPrefix`
JOIN `operateur` ON `operateur`.`id` = `operateurPrefix`.`idOperateur`
WHERE `operateur`.`id` != 5
SELECT *
FROM `operateur`
WHERE `id` != 5

    public function save()
    {
        $idOperateur = (int) $this->request->getPost('idOperateur');
        $prefix = trim((string) $this->request->getPost('prefix'));

        $operateurModel = new OperateurModel();
        $operateur = $operateurModel->find($idOperateur);

        if (! $operateur) {
            return redirect()->back()->with('error', 'Opérateur invalide ou inexistant.');
        }

        if ($prefix === '') {
            return redirect()->back()->with('error', 'Veuillez saisir un préfixe valide.');
        }

        $model = new OperateurPrefixModel();
        $model->save([
            'idOperateur' => $idOperateur,
            'prefix'      => $prefix,
        ]);
---
SELECT *
FROM `operateur`
WHERE `operateur`.`id` = 5
INSERT INTO `operateurPrefix` (`idOperateur`, `prefix`) VALUES (5, '034')