app/Controllers/StatusController.php

    public function index()
    {
        $model = new StatusModel();
        $data['status'] = $model->findAll();
---
SELECT *
FROM `status`