app/Controllers/TypeOperationController.php

    public function index()
    {
        $model = new TypeOperationModel();
        $data['types'] = $model->findAll();
---
SELECT *
FROM `typeOperation`